
# Homework 4

Some initializations

In [1]:
import numpy as np
import pandas as pd
import re
import matplotlib.pyplot as plt
import seaborn as sns
import sqlite3 as sql


## Joining data


#### Loading data

![Upper left corner of the file opened in Jupyter](cleared_cell_phones_total-csv.jpg "'Delimiter' shows the sep parameter value to use")<br><br>

In [20]:
cleared_cell_phones_total_data_df = pd.read_csv('cleared_cell_phones_total.csv', index_col='iso-3')

![Upper left corner of the file opened in Jupyter](country_data-csv.jpg "'Delimiter' shows the sep parameter value to use")<br><br>

In [24]:
country_data_df = pd.read_csv('country_data.csv', index_col='alpha-3')

![Upper left corner of the file opened in Jupyter](pop_data-csv.jpg "'Delimiter' shows the sep parameter value to use")<br><br>

In [25]:
pop_data_df = pd.read_csv('pop_data.csv', index_col='iso-3')


#### Structure of data

In [23]:
cleared_cell_phones_total_data_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 214 entries, ABW to ZWE
Data columns (total 56 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1960    214 non-null    float64
 1   1965    214 non-null    float64
 2   1966    214 non-null    float64
 3   1967    214 non-null    float64
 4   1968    214 non-null    float64
 5   1969    214 non-null    float64
 6   1970    214 non-null    float64
 7   1971    214 non-null    float64
 8   1972    214 non-null    float64
 9   1973    214 non-null    float64
 10  1974    214 non-null    float64
 11  1975    214 non-null    float64
 12  1976    214 non-null    float64
 13  1977    214 non-null    float64
 14  1978    214 non-null    float64
 15  1979    214 non-null    float64
 16  1980    214 non-null    float64
 17  1981    214 non-null    float64
 18  1982    214 non-null    float64
 19  1983    214 non-null    float64
 20  1984    214 non-null    float64
 21  1985    214 non-null    float64
 22  1986    214 non-null    float64
 23  1987    214 non-null    float64
 24  1988    214 non-null    float64
 25  1989    214 non-null    float64
 26  1990    214 non-null    float64
 27  1991    214 non-null    float64
 28  1992    214 non-null    float64
 29  1993    214 non-null    float64
 30  1994    214 non-null    float64
 31  1995    214 non-null    float64
 32  1996    214 non-null    float64
 33  1997    214 non-null    float64
 34  1998    214 non-null    float64
 35  1999    214 non-null    float64
 36  2000    214 non-null    float64
 37  2001    214 non-null    float64
 38  2002    214 non-null    float64
 39  2003    214 non-null    float64
 40  2004    214 non-null    float64
 41  2005    214 non-null    float64
 42  2006    214 non-null    float64
 43  2007    214 non-null    float64
 44  2008    214 non-null    float64
 45  2009    214 non-null    float64
 46  2010    214 non-null    float64
 47  2011    214 non-null    float64
 48  2012    214 non-null    float64
 49  2013    214 non-null    float64
 50  2014    214 non-null    float64
 51  2015    214 non-null    float64
 52  2016    214 non-null    float64
 53  2017    214 non-null    float64
 54  2018    214 non-null    float64
 55  2019    214 non-null    float64
dtypes: float64(56)
memory usage: 95.3+ KB

In [26]:
country_data_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 249 entries, AFG to ZWE
Data columns (total 10 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   name                      249 non-null    object
 1   alpha-2                   248 non-null    object
 2   country-code              249 non-null    int64
 3   iso_3166-2                249 non-null    object
 4   region                    248 non-null    object
 5   sub-region                248 non-null    object
 6   intermediate-region       107 non-null    object
 7   region-code               248 non-null    float64
 8   sub-region-code           248 non-null    float64
 9   intermediate-region-code  107 non-null    float64
dtypes: float64(3), int64(1), object(6)
memory usage: 21.4+ KB

In [28]:
pop_data_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 266 entries, ABW to ZWE
Data columns (total 62 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  266 non-null    int64
 1   1960        264 non-null    float64
 2   1961        264 non-null    float64
 3   1962        264 non-null    float64
 4   1963        264 non-null    float64
 5   1964        264 non-null    float64
 6   1965        264 non-null    float64
 7   1966        264 non-null    float64
 8   1967        264 non-null    float64
 9   1968        264 non-null    float64
 10  1969        264 non-null    float64
 11  1970        264 non-null    float64
 12  1971        264 non-null    float64
 13  1972        264 non-null    float64
 14  1973        264 non-null    float64
 15  1974        264 non-null    float64
 16  1975        264 non-null    float64
 17  1976        264 non-null    float64
 18  1977        264 non-null    float64
 19  1978        264 non-null    float64
 20  1979        264 non-null    float64
 21  1980        264 non-null    float64
 22  1981        264 non-null    float64
 23  1982        264 non-null    float64
 24  1983        264 non-null    float64
 25  1984        264 non-null    float64
 26  1985        264 non-null    float64
 27  1986        264 non-null    float64
 28  1987        264 non-null    float64
 29  1988        264 non-null    float64
 30  1989        264 non-null    float64
 31  1990        265 non-null    float64
 32  1991        265 non-null    float64
 33  1992        265 non-null    float64
 34  1993        265 non-null    float64
 35  1994        265 non-null    float64
 36  1995        265 non-null    float64
 37  1996        265 non-null    float64
 38  1997        265 non-null    float64
 39  1998        265 non-null    float64
 40  1999        265 non-null    float64
 41  2000        265 non-null    float64
 42  2001        265 non-null    float64
 43  2002        265 non-null    float64
 44  2003        265 non-null    float64
 45  2004        265 non-null    float64
 46  2005        265 non-null    float64
 47  2006        265 non-null    float64
 48  2007        265 non-null    float64
 49  2008        265 non-null    float64
 50  2009        265 non-null    float64
 51  2010        265 non-null    float64
 52  2011        265 non-null    float64
 53  2012        265 non-null    float64
 54  2013        265 non-null    float64
 55  2014        265 non-null    float64
 56  2015        265 non-null    float64
 57  2016        265 non-null    float64
 58  2017        265 non-null    float64
 59  2018        265 non-null    float64
 60  2019        265 non-null    float64
 61  2020        265 non-null    float64
dtypes: float64(61), int64(1)
memory usage: 130.9+ KB


#### Cleaning data

We know that the data in **cleared_cell_phones_total_data_df** is cleaned already.

In **country_data_df** there are many null values. To save a lot of work and time, it would be good to only clean data that will be needed to solve the assignment.

It seems that only the **name** column will be used. This column has no null values, but its Dtype is object. Converting this to Dtype string would be beneficial.

In [32]:
def object_to_string(x):
    return str(x)

In [36]:
y = 5.3

In [37]:
type(y)

float

In [38]:
y_string = object_to_string(y)

In [39]:
type(y_string)

str

First, make a deep copy of country_data_df.

In [40]:
name_strings_country_data_df = country_data_df.copy()

Now, convert the values in the name column to strings.

In [41]:
#name_strings_country_data_df['name'] = country_data_df['name'].map(object_to_string)

In [43]:
name_strings_country_data_df['name'] = country_data_df['name'].astype("string")

name_strings_country_data_df.info()

For **pop_data_df** it seems that we only need data for the years 1960 and 2010-2019, for a few countries. These countries are ABW, AFG, AGO, ALB, AND, Macao, Hong Kong, United Arab Emirates,	Antigua and Barbuda, and Seychelles.

There are some null values in pop_data_df. We have to check if any of these concerns the years and countries we will treat.

First, we will get the alpha-3 codes for the names.

In [55]:
alpha_3_codes = name_strings_country_data_df['name'].isin(['Macao', 'Hong Kong', 'United Arab Emirates','Antigua and Barbuda', 'Seychelles'])

In [56]:
name_strings_country_data_df[alpha_3_codes]

,name,alpha-2,country-code,iso_3166-2,region,sub-region,intermediate-region,region-code,sub-region-code,intermediate-region-code
alpha-3,,,,,,,,,,
ATG,Antigua and Barbuda,AG,28,ISO 3166-2:AG,Americas,Latin America and the Caribbean,Caribbean,19.0,419.0,29.0
HKG,Hong Kong,HK,344,ISO 3166-2:HK,Asia,Eastern Asia,NaN,142.0,30.0,NaN
MAC,Macao,MO,446,ISO 3166-2:MO,Asia,Eastern Asia,NaN,142.0,30.0,NaN
SYC,Seychelles,SC,690,ISO 3166-2:SC,Africa,Sub-Saharan Africa,Eastern Africa,2.0,202.0,14.0
ARE,United Arab Emirates,AE,784,ISO 3166-2:AE,Asia,Western Asia,NaN,142.0,145.0,NaN

Now we can select the interesting rows in pop_data_df.

In [72]:
interesting_countries_bool = pop_data_df.index.isin(['ATG','HKG','MAC','SYC','ARE','ABW', 'AFG', 'AGO', 'ALB', 'AND'])

In [73]:
# interesting_countries = pop_data_df['ATG']

In [74]:
interesting_years = ['1960', '2010','2011','2012','2013','2014','2015','2016','2017','2018','2019']

In [75]:
interesting_countries_df = pop_data_df[interesting_countries_bool]

In [76]:
interesting_countries_and_years_df = interesting_countries_df[interesting_years]

In [77]:
interesting_countries_and_years_df

,1960,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
iso-3,,,,,,,,,,,
ABW,54608.0,100341.0,101288.0,102112.0,102880.0,103594.0,104257.0,104874.0,105439.0,105962.0,106442.0
AFG,8622466.0,28189672.0,29249157.0,30466479.0,31541209.0,32716210.0,33753499.0,34636207.0,35643418.0,36686784.0,37769499.0
AGO,5357195.0,23364185.0,24259111.0,25188292.0,26147002.0,27128337.0,28127721.0,29154746.0,30208628.0,31273533.0,32353588.0
ALB,1608800.0,2913021.0,2905195.0,2900401.0,2895092.0,2889104.0,2880703.0,2876101.0,2873457.0,2866376.0,2854191.0
AND,9443.0,71519.0,70567.0,71013.0,71367.0,71621.0,71746.0,72540.0,73837.0,75013.0,76343.0
ARE,133426.0,8481771.0,8575205.0,8664969.0,8751847.0,8835951.0,8916899.0,8994263.0,9068296.0,9140169.0,9211657.0
ATG,55342.0,85695.0,86729.0,87674.0,88497.0,89236.0,89941.0,90564.0,91119.0,91626.0,92117.0
HKG,3114671.0,7024200.0,7071600.0,7150100.0,7178900.0,7229500.0,7291300.0,7336600.0,7393200.0,7452600.0,7507900.0
MAC,177014.0,557297.0,571003.0,582766.0,593374.0,604167.0,615239.0,626688.0,638609.0,650991.0,663653.0
SYC,41700.0,89770.0,87441.0,88303.0,89949.0,91359.0,93419.0,94677.0,95843.0,96762.0,97625.0

In [78]:
interesting_countries_and_years_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, ABW to SYC
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1960    10 non-null     float64
 1   2010    10 non-null     float64
 2   2011    10 non-null     float64
 3   2012    10 non-null     float64
 4   2013    10 non-null     float64
 5   2014    10 non-null     float64
 6   2015    10 non-null     float64
 7   2016    10 non-null     float64
 8   2017    10 non-null     float64
 9   2018    10 non-null     float64
 10  2019    10 non-null     float64
dtypes: float64(11)
memory usage: 960.0+ bytes


##### We see that there are no null values to handle for the countries and years we are interested in.


###### Tests

In [47]:
iso_3_1960_nan = pop_data_df['1960']==np.nan

In [48]:
pop_data_df[iso_3_1960_nan]

Empty DataFrame
Columns: [Unnamed: 0, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020]
Index: []

[0 rows x 62 columns]

In [49]:
iso_3_1960_empty_string = pop_data_df['1960']==""

In [50]:
pop_data_df[iso_3_1960_empty_string]

Empty DataFrame
Columns: [Unnamed: 0, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020]
Index: []

[0 rows x 62 columns]

In [ ]:
ABW	1960	0	54608
AFG	1960	0	8.62247e+06
AGO	1960	0	5.3572e+06
ALB	1960	0	1.6088e+06
AND

In [ ]:
Macao	Hong Kong	United Arab Emirates	Antigua and Barbuda	Seychelles


## SQL

Connect to the database and look at the data

In [2]:
# conn = sql.connect("./user_actions.sqlite3")
conn = sql.connect("./user_actions.db")
cursor = conn.cursor()

In [3]:
tables = list(cursor.execute("SELECT name FROM sqlite_master WHERE type='table';"))
tables

[('user_actions',)]

In [4]:
# SELECT

query = """
SELECT * 
FROM user_actions
"""

cursor.execute(query)

# for data in cursor.fetchall():
for data in cursor.fetchone():    
    print(data)
user_action_pd = pd.read_sql_query(query, conn)

34
user34
user34@email.com
signup
2015-02-04 14:38:47
None

In [5]:
user_action_pd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8040 entries, 0 to 8039
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   user_id    8040 non-null   int64
 1   username   8040 non-null   object
 2   email      8040 non-null   object
 3   action     8040 non-null   object
 4   timestamp  8040 non-null   object
 5   day        0 non-null      object
dtypes: int64(1), object(5)
memory usage: 377.0+ KB


#### Users who have "signedup"

In [6]:
query = """
SELECT username 
FROM user_actions
WHERE action='signup'
"""

cursor.execute(query)

for data in cursor.fetchall():
# for data in cursor.fetchone():    
    print(data)
# pd.read_sql_query(query, conn)
pd.read_sql_query(query, conn).sort_values(by='username')

('user34',)
('user28',)
('user1',)
('user24',)
('user15',)
('user20',)
('user18',)
('user25',)
('user3',)
('user9',)
('user27',)
('user16',)
('user17',)
('user4',)
('user8',)
('user13',)
('user19',)
('user31',)
('user10',)
('user23',)
('user11',)
('user33',)
('user12',)
('user29',)
('user21',)
('user6',)
('user14',)
('user30',)
('user7',)
('user26',)
('user22',)
('user5',)
('user35',)
('user2',)
('user32',)

   username
2     user1
18   user10
20   user11
22   user12
15   user13
26   user14
4    user15
11   user16
12   user17
6    user18
16   user19
33    user2
5    user20
24   user21
30   user22
19   user23
3    user24
7    user25
29   user26
10   user27
1    user28
23   user29
8     user3
27   user30
17   user31
34   user32
21   user33
0    user34
32   user35
13    user4
31    user5
25    user6
28    user7
14    user8
9     user9


#### Total number of log entries for each user

In [7]:
query = """
SELECT user_id, username, count(*) 
FROM user_actions
WHERE action='login'
GROUP BY username
"""

cursor.execute(query)

for data in cursor.fetchall():
# for data in cursor.fetchone():    
    print(data)
# pd.read_sql_query(query, conn)
pd.read_sql_query(query, conn).sort_values(by='username')

(1, 'user1', 97)
(10, 'user10', 163)
(11, 'user11', 319)
(12, 'user12', 202)
(13, 'user13', 464)
(14, 'user14', 311)
(15, 'user15', 30)
(16, 'user16', 370)
(17, 'user17', 356)
(18, 'user18', 116)
(19, 'user19', 48)
(2, 'user2', 139)
(20, 'user20', 353)
(21, 'user21', 318)
(22, 'user22', 264)
(23, 'user23', 301)
(24, 'user24', 152)
(25, 'user25', 131)
(26, 'user26', 213)
(27, 'user27', 201)
(28, 'user28', 81)
(29, 'user29', 42)
(3, 'user3', 101)
(30, 'user30', 160)
(31, 'user31', 381)
(32, 'user32', 22)
(33, 'user33', 23)
(34, 'user34', 175)
(35, 'user35', 384)
(4, 'user4', 425)
(5, 'user5', 182)
(6, 'user6', 448)
(7, 'user7', 358)
(8, 'user8', 318)
(9, 'user9', 109)

    user_id username  count(*)
0         1    user1        97
1        10   user10       163
2        11   user11       319
3        12   user12       202
4        13   user13       464
5        14   user14       311
6        15   user15        30
7        16   user16       370
8        17   user17       356
9        18   user18       116
10       19   user19        48
11        2    user2       139
12       20   user20       353
13       21   user21       318
14       22   user22       264
15       23   user23       301
16       24   user24       152
17       25   user25       131
18       26   user26       213
19       27   user27       201
20       28   user28        81
21       29   user29        42
22        3    user3       101
23       30   user30       160
24       31   user31       381
25       32   user32        22
26       33   user33        23
27       34   user34       175
28       35   user35       384
29        4    user4       425
30        5    user5       182
31        6    user6       448
32        7    user7       358
33        8    user8       318
34        9    user9       109


#### Users who have logged in and signed up on the same day

Create new column, 'day', from 'timestamp'.

In [8]:
day_column = 'day'
table_name = 'user_actions'
# cursor.execute("ALTER TABLE {tn} ADD COLUMN '{cn}'"\
#         .format(tn=table_name, cn=day_column))

In [9]:
query = """
SELECT *
FROM user_actions
"""

cursor.execute(query)

# for data in cursor.fetchall():
for data in cursor.fetchone():    
    print(data)

34
user34
user34@email.com
signup
2015-02-04 14:38:47
None

In [15]:
query = """
SELECT user_id, username, timestamp
FROM user_actions
WHERE action='login' OR action='signup'
GROUP BY timestamp[0:9]
"""

query = """
SELECT user_id, username, date(timestamp)
FROM user_actions
WHERE action='login' OR action='signup'
GROUP BY username, date(timestamp)
"""
cursor.execute(query)

for data in cursor.fetchone():
# for data in cursor.fetchone():    
    print(data)
# pd.read_sql_query(query, conn)
pd.read_sql_query(query, conn).sort_values(by='username')

1
user1
2015-11-06

      user_id username date(timestamp)
0           1    user1      2015-11-06
27          1    user1      2022-12-05
28          1    user1      2022-12-06
29          1    user1      2022-12-07
30          1    user1      2022-12-08
...       ...      ...             ...
5648        9    user9      2020-04-19
5647        9    user9      2020-04-06
5646        9    user9      2020-04-03
5656        9    user9      2020-07-08
5721        9    user9      2022-12-07

[5722 rows x 3 columns]

In [19]:
query = """
SELECT user_id, username, action, date(timestamp)
FROM user_actions
WHERE username='user1' AND (action='login' OR action='signup')
GROUP BY date(timestamp)
"""
cursor.execute(query)

for data in cursor.fetchall():
# for data in cursor.fetchone():    
    print(data)
# pd.read_sql_query(query, conn)
pd.read_sql_query(query, conn).sort_values(by='username')

(1, 'user1', 'signup', '2015-11-06')
(1, 'user1', 'login', '2022-11-05')
(1, 'user1', 'login', '2022-11-06')
(1, 'user1', 'login', '2022-11-07')
(1, 'user1', 'login', '2022-11-08')
(1, 'user1', 'login', '2022-11-09')
(1, 'user1', 'login', '2022-11-10')
(1, 'user1', 'login', '2022-11-11')
(1, 'user1', 'login', '2022-11-12')
(1, 'user1', 'login', '2022-11-13')
(1, 'user1', 'login', '2022-11-15')
(1, 'user1', 'login', '2022-11-16')
(1, 'user1', 'login', '2022-11-17')
(1, 'user1', 'login', '2022-11-18')
(1, 'user1', 'login', '2022-11-21')
(1, 'user1', 'login', '2022-11-22')
(1, 'user1', 'login', '2022-11-23')
(1, 'user1', 'login', '2022-11-24')
(1, 'user1', 'login', '2022-11-26')
(1, 'user1', 'login', '2022-11-27')
(1, 'user1', 'login', '2022-11-28')
(1, 'user1', 'login', '2022-11-29')
(1, 'user1', 'login', '2022-11-30')
(1, 'user1', 'login', '2022-12-01')
(1, 'user1', 'login', '2022-12-02')
(1, 'user1', 'login', '2022-12-03')
(1, 'user1', 'login', '2022-12-04')
(1, 'user1', 'login', '2022-12-05')
(1, 'user1', 'login', '2022-12-06')
(1, 'user1', 'login', '2022-12-07')
(1, 'user1', 'login', '2022-12-08')
(1, 'user1', 'login', '2022-12-09')
(1, 'user1', 'login', '2022-12-11')
(1, 'user1', 'login', '2022-12-12')
(1, 'user1', 'login', '2022-12-13')
(1, 'user1', 'login', '2022-12-15')
(1, 'user1', 'login', '2022-12-18')
(1, 'user1', 'login', '2022-12-19')
(1, 'user1', 'login', '2022-12-21')
(1, 'user1', 'login', '2022-12-22')
(1, 'user1', 'login', '2022-12-23')
(1, 'user1', 'login', '2022-12-24')
(1, 'user1', 'login', '2022-12-25')
(1, 'user1', 'login', '2022-12-26')
(1, 'user1', 'login', '2022-12-28')
(1, 'user1', 'login', '2022-12-29')
(1, 'user1', 'login', '2022-12-30')
(1, 'user1', 'login', '2022-12-31')
(1, 'user1', 'login', '2023-01-01')

    user_id username  action date(timestamp)
0         1    user1  signup      2015-11-06
26        1    user1   login      2022-12-04
27        1    user1   login      2022-12-05
28        1    user1   login      2022-12-06
29        1    user1   login      2022-12-07
30        1    user1   login      2022-12-08
31        1    user1   login      2022-12-09
32        1    user1   login      2022-12-11
33        1    user1   login      2022-12-12
34        1    user1   login      2022-12-13
35        1    user1   login      2022-12-15
36        1    user1   login      2022-12-18
37        1    user1   login      2022-12-19
38        1    user1   login      2022-12-21
39        1    user1   login      2022-12-22
40        1    user1   login      2022-12-23
41        1    user1   login      2022-12-24
42        1    user1   login      2022-12-25
43        1    user1   login      2022-12-26
44        1    user1   login      2022-12-28
45        1    user1   login      2022-12-29
46        1    user1   login      2022-12-30
25        1    user1   login      2022-12-03
47        1    user1   login      2022-12-31
24        1    user1   login      2022-12-02
22        1    user1   login      2022-11-30
1         1    user1   login      2022-11-05
2         1    user1   login      2022-11-06
3         1    user1   login      2022-11-07
4         1    user1   login      2022-11-08
5         1    user1   login      2022-11-09
6         1    user1   login      2022-11-10
7         1    user1   login      2022-11-11
8         1    user1   login      2022-11-12
9         1    user1   login      2022-11-13
10        1    user1   login      2022-11-15
11        1    user1   login      2022-11-16
12        1    user1   login      2022-11-17
13        1    user1   login      2022-11-18
14        1    user1   login      2022-11-21
15        1    user1   login      2022-11-22
16        1    user1   login      2022-11-23
17        1    user1   login      2022-11-24
18        1    user1   login      2022-11-26
19        1    user1   login      2022-11-27
20        1    user1   login      2022-11-28
21        1    user1   login      2022-11-29
23        1    user1   login      2022-12-01
48        1    user1   login      2023-01-01

In [14]:
query = """
SELECT user_id, username, day
FROM user_actions
WHERE action='login' OR action='signup'
GROUP BY day
"""

cursor.execute(query)

for data in cursor.fetchone():
# for data in cursor.fetchone():    
    print(data)
# pd.read_sql_query(query, conn)
pd.read_sql_query(query, conn).sort_values(by='username')

34
user34
None

   user_id username   day
0       34   user34  None


## Regex


#### Read data from file

In [ ]:
# first_part = r"[0-9]{1,2}\."

In [ ]:
first_part = r"^\d{1,3}\."

In [ ]:
comments_pd = pd.read_table('comments.txt', sep=first_part, names=['id', 'comment'], engine='python')

In [ ]:
comments_pd['comment'].head()

In [ ]:
comments_pd.info()

In [ ]:
comments_pd.head()

In [ ]:
comments_pd.dtypes


##### Drop the 'id' column and convert the comments to strings

This will create a Series of strings.

In [ ]:
string_comments = comments_pd['comment'].astype({'comment' : 'string'}, copy=True)

In [ ]:
string_comments.info()

In [ ]:
string_comments.head(6)

In [ ]:
string_comments.tail()

In [ ]:
string_comments[99]

In [ ]:
string_comments[97]

In [ ]:
string_comments[1]


#### Solve tasks


##### All hashtags

In [ ]:
# pattern_all_hashtags_1 = r"g\b#{1}[\d\w]+\b"
# pattern_all_hashtags_1

In [ ]:
# pattern_all_hashtags_2 = r"\b#{1}[\d\w]+"
# pattern_all_hashtags_2

In [ ]:
# pattern_all_hashtags_3 = r"\b\#[\w]+"
# pattern_all_hashtags_3

In [ ]:
# pattern_all_hashtags_4 = r"\b#"
# pattern_all_hashtags_4

In [ ]:
# pattern_all_hashtags_5 = r"\bE+[\w]+"
# pattern_all_hashtags_5

In [ ]:
# pattern_all_hashtags_6 = r"\b[\x23]{1}"
# pattern_all_hashtags_6

In [ ]:
# pattern_all_hashtags_7 = r"[\x23]{1}[\w]+"
# pattern_all_hashtags_7

In [ ]:
pattern_all_hashtags = r"[#]{1}[\w]+"
pattern_all_hashtags

In [ ]:
tag_comment_1 = re.findall(pattern_all_hashtags, string_comments[1])
print(tag_comment_1)

In [ ]:
tag_comment_0 = re.findall(pattern_all_hashtags, string_comments[0])
print(tag_comment_0)


##### Both #programming and #python

In [ ]:
pattern_both_test = r"[#programming]+ och [#python]+"
pattern_both_test

In [ ]:
pattern_both = r"[#p]{1}[\w]+[o]{1}[\w]*[n]{1}[\w]*"
pattern_both

In [ ]:
both_tag_comment_0 = re.findall(pattern_both, string_comments[0])
print(both_tag_comment_0)

In [ ]:
both_tag_comment_1 = re.findall(pattern_both, string_comments[1])
print(both_tag_comment_1)

In [ ]:
both_tag_comment_5 = re.findall(pattern_both, string_comments[5])
print(both_tag_comment_5)

We see that this patterna finds both #programming och #python, if they exist in a comment. It also finds some other tags, e.g. #coding, but it was not a requirement that no other tags should be found.


##### All unique hash tags

In [ ]:
all_tags = []
for i in range(99):
    all_tags.append(re.findall(pattern_all_hashtags, string_comments[i]))

In [ ]:
all_tags

In [ ]:
type(all_tags)

In [ ]:
len(all_tags)

Från kurs_demo

In [ ]:
string = "Please contact support@example.com for assistance. For general inquiries, you can email info@company.com and @gmail.com"
print(string)

In [ ]:
pattern = r"\b[\w._%+-]+@[\w.-]+\.[A-Za-z]{2,4}\b"
r"\b[\w._%+-]+@[\w.-]+\.[A-Za-z]{2,4}\b"

In [ ]:
emails = re.findall(pattern, string)
print(emails)